; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v4 ?v2)
             (pred_11 ?v5 ?v10)
             (pred_5 ?v4 ?v10)
             (pred_1 ?v3 ?v4 )
	     (pred_2 ?v4)
             (pred_4 ?v9)
             (pred_7 ?v5)
             (pred_9 ?v10)
             (pred_12 ?v4)
             (pred_6 ?v5)
             (pred_3 ?v4)
             (pred_10 ))



(:action op_4
:parameters (?v1 ?v13 ?v12 ?v11)
:precondition (and (pred_4 ?v1) (pred_4 ?v13) (pred_7 ?v12) (pred_9 ?v11)
          (pred_8 ?v1 ?v13) (pred_11 ?v12 ?v11)
                   (pred_5 ?v13 ?v11) (pred_2 ?v1) 
                   (pred_12 ?v13) (pred_6 ?v12))
:effect (and  (pred_3 ?v13) (not (pred_12 ?v13))))


(:action op_2
:parameters (?v1 ?v6)
:precondition (and (pred_4 ?v1) (pred_4 ?v6)
               (pred_2 ?v1) (pred_8 ?v1 ?v6) (pred_3 ?v6))
:effect (and (pred_2 ?v6) (not (pred_2 ?v1))))

(:action op_3
:parameters (?v1 ?v12)
:precondition (and (pred_4 ?v1) (pred_7 ?v12) 
                  (pred_2 ?v1) (pred_1 ?v12 ?v1) (pred_10 ))
:effect (and (pred_6 ?v12)
   (not (pred_1 ?v12 ?v1)) (not (pred_10 ))))


(:action op_5
:parameters (?v1 ?v8 ?v7)
:precondition (and (pred_4 ?v1) (pred_7 ?v8) (pred_7 ?v7)
                  (pred_2 ?v1) (pred_6 ?v7) (pred_1 ?v8 ?v1))
:effect (and (pred_6 ?v8) (pred_1 ?v7 ?v1)
        (not (pred_6 ?v7)) (not (pred_1 ?v8 ?v1))))

(:action op_1
:parameters (?v1 ?v12)
:precondition (and (pred_4 ?v1) (pred_7 ?v12) 
                  (pred_2 ?v1) (pred_6 ?v12))
:effect (and (pred_10 ) (pred_1 ?v12 ?v1) (not (pred_6 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_19 obj_01 obj_15 obj_17 obj_11 obj_08 obj_03 obj_02 obj_07 obj_05 obj_21 obj_18 obj_04 obj_09 obj_12
    obj_10 obj_14
    obj_06 obj_20 obj_16
    )

    (:init
       (pred_10)

       (pred_4 obj_13)
       (pred_4 obj_19)
       (pred_4 obj_01)
       (pred_4 obj_15)
       (pred_4 obj_17)
       (pred_4 obj_11)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_4 obj_05)
       (pred_4 obj_21)
       (pred_4 obj_18)
       (pred_4 obj_04)
       (pred_4 obj_09)
       (pred_4 obj_12)
       (pred_9 obj_10)
       (pred_9 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_20)
       (pred_7 obj_16)

       (pred_8 obj_13 obj_17)
       (pred_8 obj_13 obj_19)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_19 obj_01)
       (pred_8 obj_19 obj_13)
       (pred_8 obj_01 obj_08)
       (pred_8 obj_01 obj_15)
       (pred_8 obj_01 obj_19)
       (pred_8 obj_15 obj_03)
       (pred_8 obj_15 obj_01)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_11 obj_07)
       (pred_8 obj_11 obj_08)
       (pred_8 obj_11 obj_19)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_08 obj_05)
       (pred_8 obj_08 obj_03)
       (pred_8 obj_08 obj_01)
       (pred_8 obj_08 obj_11)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_03 obj_15)
       (pred_8 obj_03 obj_08)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_02 obj_07)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_07 obj_04)
       (pred_8 obj_07 obj_05)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_07 obj_02)
       (pred_8 obj_05 obj_09)
       (pred_8 obj_05 obj_21)
       (pred_8 obj_05 obj_08)
       (pred_8 obj_05 obj_07)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_21 obj_05)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_07)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_09 obj_12)
       (pred_8 obj_09 obj_05)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_12 obj_09)
       (pred_12 obj_01)
       (pred_12 obj_15)
       (pred_12 obj_21)
       (pred_5  obj_01 obj_10)
       (pred_5  obj_15 obj_14)
       (pred_5  obj_21 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_19)
       (pred_3 obj_17)
       (pred_3 obj_11)
       (pred_3 obj_08)
       (pred_3 obj_03)
       (pred_3 obj_02)
       (pred_3 obj_07)
       (pred_3 obj_05)
       (pred_3 obj_18)
       (pred_3 obj_04)
       (pred_3 obj_09)
       (pred_3 obj_12)

       (pred_11  obj_06 obj_10)
       (pred_11  obj_20 obj_14)
       (pred_11  obj_16 obj_14)
       (pred_1 obj_06 obj_08)
       (pred_1 obj_20 obj_17)
       (pred_1 obj_16 obj_17)
       (pred_2 obj_02)
    )

    (:goal (and
       (pred_1 obj_06 obj_09)
       (pred_1 obj_20 obj_07)
       (pred_1 obj_16 obj_19)
    ))
(:constraints
  (always (not (pred_2 obj_11)))
)
)

; plan
1. (op_2 obj_02 obj_17)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_17)
   goals met: 0 of 3
2. (op_3 obj_17 obj_16)
   deleted: (pred_1 obj_16 obj_17) (pred_10)
   added: (pred_6 obj_16)
   goals met: 0 of 3
3. (op_2 obj_17 obj_13)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_13)
   goals met: 0 of 3
4. (op_2 obj_13 obj_19)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_19)
   goals met: 0 of 3
5. (op_1 obj_19 obj_16)
   deleted: (pred_6 obj_16)
   added: (pred_10) (pred_1 obj_16 obj_19)
   goals met: 1 of 3
6. (op_2 obj_19 obj_13)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_13)
   goals met: 1 of 3
7. (op_2 obj_13 obj_17)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_17)
   goals met: 1 of 3
8. (op_3 obj_17 obj_20)
   deleted: (pred_1 obj_20 obj_17) (pred_10)
   added: (pred_6 obj_20)
   goals met: 1 of 3
9. (op_2 obj_17 obj_02)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_02)
   goals met: 1 of 3
10. (op_2 obj_02 obj_07)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_07)
   goals met: 1 of 3
11. (op_1 obj_07 obj_20)
   deleted: (pred_6 obj_20)
   added: (pred_10) (pred_1 obj_20 obj_07)
   goals met: 2 of 3
12. (op_2 obj_07 obj_05)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_05)
   goals met: 2 of 3
13. (op_2 obj_05 obj_08)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_08)
   goals met: 2 of 3
14. (op_3 obj_08 obj_06)
   deleted: (pred_1 obj_06 obj_08) (pred_10)
   added: (pred_6 obj_06)
   goals met: 2 of 3
15. (op_2 obj_08 obj_05)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_05)
   goals met: 2 of 3
16. (op_2 obj_05 obj_09)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_09)
   goals met: 2 of 3
17. (op_1 obj_09 obj_06)
   deleted: (pred_6 obj_06)
   added: (pred_10) (pred_1 obj_06 obj_09)
   goals met: 3 of 3
